In [2]:
import numpy as np
from numpy import nan
from pandas import Series, DataFrame
import pandas as pd

In [5]:
# サンプルデータ作成 Series
data = Series(['one','two', np.nan, 'four'])
data

0     one
1     two
2     NaN
3    four
dtype: object

In [6]:
# null値の確認
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [8]:
# null値の削除
data.dropna()

0     one
1     two
3    four
dtype: object

In [10]:
# サンプルデータ作成 DataFrame
dframe = DataFrame([[1,2,3],[4,5,np.nan],[7,np.nan,9],[np.nan,np.nan,np.nan]])
dframe

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [17]:
# Nullが含まれる行削除
dframe.dropna()

     0    1    2
0  1.0  2.0  3.0

In [15]:
# 削除指定　以下の場合は全データがNullの行が削除される
dframe.dropna(how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  9.0

In [20]:
# 削除 軸指定 全ての列にNullがあるため全ての列が削除
dframe.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [22]:
# 削除 軸指定 列全てがNullの場合　今回のデータで削除される列はない
dframe.dropna(axis=1, how='all')

     0    1    2
0  1.0  2.0  3.0
1  4.0  5.0  NaN
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [27]:
# サンプルデータ作成
dframe2 = DataFrame([[1,2,3,nan],[nan,2,nan,nan],[nan,8,nan,9],[nan,2,nan,nan]])
dframe2

     0  1    2    3
0  1.0  2  3.0  NaN
1  NaN  2  NaN  NaN
2  NaN  8  NaN  9.0
3  NaN  2  NaN  NaN

In [29]:
# 削除 閾値指定 not null値が2個以上
dframe2.dropna(thresh=2)

     0  1    2    3
0  1.0  2  3.0  NaN
2  NaN  8  NaN  9.0

In [30]:
# 3個以上
dframe2.dropna(thresh=3)

     0  1    2   3
0  1.0  2  3.0 NaN

In [31]:
# null値に代入
dframe2.fillna(1)

     0  1    2    3
0  1.0  2  3.0  1.0
1  1.0  2  1.0  1.0
2  1.0  8  1.0  9.0
3  1.0  2  1.0  1.0

In [33]:
# 列ごとに代入値を指定
dframe2.fillna({0:-10,1:-20,2:-30,3:-40})

      0  1     2     3
0   1.0  2   3.0 -40.0
1 -10.0  2 -30.0 -40.0
2 -10.0  8 -30.0   9.0
3 -10.0  2 -30.0 -40.0

In [34]:
dframe2

     0  1    2    3
0  1.0  2  3.0  NaN
1  NaN  2  NaN  NaN
2  NaN  8  NaN  9.0
3  NaN  2  NaN  NaN

In [35]:
# 元のDataframe自体に代入を行いたい場合は、inplace=Trueを記述　以下では、元データのNullが0に置き換わる
dframe2.fillna(0,inplace=True)

In [36]:
dframe2

     0  1    2    3
0  1.0  2  3.0  0.0
1  0.0  2  0.0  0.0
2  0.0  8  0.0  9.0
3  0.0  2  0.0  0.0